# 🏗️ Infrastructure Deployment Report

id: #tf-infra-report

[start_section_bootstrap]
## 🌎 BOOTSTRAP Environment
_Last Updated: Fri, 20 Feb 2026, 14:53:01 IST_ | _Commit: [`a83cee9`](https://github.com/BPT-1999/iac-foundation/commit/a83cee98db3f044613631973e5029e22749417d0)_

### 📂 COMMON (`01-resource-hierarchy`)

#### 📁 `01-resource-hierarchy/01-storages`

**Plan Summary:** `Plan: 1 to add, 0 to change, 0 to destroy`

<details><summary>📦 VALIDATE Output</summary>

```terraform
Success! The configuration is valid.
```
</details>
<details><summary>📦 TFLINT Output</summary>

```terraform
✅ TFLint completed successfully – no issues found.
```
</details>
<details><summary>📦 CHECKOV Output</summary>

```terraform
_               _
   ___| |__   ___  ___| | _______   __
  / __| '_ \ / _ \/ __| |/ / _ \ \ / /
 | (__| | | |  __/ (__|   < (_) \ V /
  \___|_| |_|\___|\___|_|\_\___/ \_/

By Prisma Cloud | version: 3.2.501 
Update available 3.2.501 -> 3.2.504
Run pip3 install -U checkov to update 


terraform_plan scan results:

Passed checks: 2, Failed checks: 0, Skipped checks: 0

Check: CKV_GCP_78: "Ensure Cloud storage has versioning enabled"
	PASSED for resource: module.cloud_storage["gcs-myntra-bootstrap-tvdsfas2"].google_storage_bucket.bucket[0]
	File: /tf-01-resource-hierarchy-01-storages.json:0-0
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/google-cloud-policies/google-cloud-general-policies/ensure-gcp-cloud-storage-has-versioning-enabled
Check: CKV_GCP_29: "Ensure that Cloud Storage buckets have uniform bucket-level access enabled"
	PASSED for resource: module.cloud_storage["gcs-myntra-bootstrap-tvdsfas2"].google_storage_bucket.bucket[0]
	File: /tf-01-resource-hierarchy-01-storages.json:0-0
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/google-cloud-policies/google-cloud-storage-gcs-policies/bc-gcp-gcs-2
```
</details>
<details><summary>📦 PLAN Output</summary>

```terraform
Terraform Actions:


  # module.cloud_storage["gcs-myntra-bootstrap-tvdsfas2"].google_storage_bucket.bucket[0] will be created
  + resource "google_storage_bucket" "bucket" {
      + effective_labels            = {
          + "env"                        = "dev"
          + "goog-terraform-provisioned" = "true"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = {
          + "env" = "dev"
        }
      + location                    = "ASIA-SOUTH1"
      + name                        = "gcs-myntra-bootstrap-tvdsfas2"
      + project                     = "prj-infra-flipkart-poc-42"
      + project_number              = (known after apply)
      + public_access_prevention    = "enforced"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "env"                        = "dev"
          + "goog-terraform-provisioned" = "true"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = true
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + lifecycle_rule {
          + action {
              + type          = "Delete"
                # (1 unchanged attribute hidden)
            }
          + condition {
              + days_since_noncurrent_time = 7
              + matches_prefix             = []
              + matches_storage_class      = []
              + matches_suffix             = []
              + num_newer_versions         = 3
              + with_state                 = (known after apply)
                # (3 unchanged attributes hidden)
            }
        }

      + soft_delete_policy (known after apply)

      + versioning {
          + enabled = true
        }

      + website (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to:
/tmp/actions-runner-ghr-common-secfoundation-wpnti-2/_work/_temp/tf-artifacts/01-resource-hierarchy/01-resource-hierarchy-01-storages/tf-01-resource-hierarchy-01-storages.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "/tmp/actions-runner-ghr-common-secfoundation-wpnti-2/_work/_temp/tf-artifacts/01-resource-hierarchy/01-resource-hierarchy-01-storages/tf-01-resource-hierarchy-01-storages.plan"
```
</details>

---
### 📂 COMMON (`02-folders`)

#### 📁 `02-folders/02-storages`

**Plan Summary:** `Plan: 1 to add, 0 to change, 0 to destroy`

<details><summary>📦 VALIDATE Output</summary>

```terraform
Success! The configuration is valid.
```
</details>
<details><summary>📦 TFLINT Output</summary>

```terraform
✅ TFLint completed successfully – no issues found.
```
</details>
<details><summary>📦 CHECKOV Output</summary>

```terraform
_               _
   ___| |__   ___  ___| | _______   __
  / __| '_ \ / _ \/ __| |/ / _ \ \ / /
 | (__| | | |  __/ (__|   < (_) \ V /
  \___|_| |_|\___|\___|_|\_\___/ \_/

By Prisma Cloud | version: 3.2.501 
Update available 3.2.501 -> 3.2.504
Run pip3 install -U checkov to update 


terraform_plan scan results:

Passed checks: 2, Failed checks: 0, Skipped checks: 0

Check: CKV_GCP_78: "Ensure Cloud storage has versioning enabled"
	PASSED for resource: module.cloud_storage["gcs-bootstrap-fsadfasdfasdfvv121"].google_storage_bucket.bucket[0]
	File: /tf-02-folders-02-storages.json:0-0
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/google-cloud-policies/google-cloud-general-policies/ensure-gcp-cloud-storage-has-versioning-enabled
Check: CKV_GCP_29: "Ensure that Cloud Storage buckets have uniform bucket-level access enabled"
	PASSED for resource: module.cloud_storage["gcs-bootstrap-fsadfasdfasdfvv121"].google_storage_bucket.bucket[0]
	File: /tf-02-folders-02-storages.json:0-0
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/google-cloud-policies/google-cloud-storage-gcs-policies/bc-gcp-gcs-2
```
</details>
<details><summary>📦 PLAN Output</summary>

```terraform
Terraform Actions:


  # module.cloud_storage["gcs-bootstrap-fsadfasdfasdfvv121"].google_storage_bucket.bucket[0] will be created
  + resource "google_storage_bucket" "bucket" {
      + effective_labels            = {
          + "env"                        = "dev"
          + "goog-terraform-provisioned" = "true"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = {
          + "env" = "dev"
        }
      + location                    = "ASIA-SOUTH1"
      + name                        = "gcs-bootstrap-fsadfasdfasdfvv121"
      + project                     = "prj-infra-flipkart-poc-42"
      + project_number              = (known after apply)
      + public_access_prevention    = "enforced"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "env"                        = "dev"
          + "goog-terraform-provisioned" = "true"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = true
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + lifecycle_rule {
          + action {
              + type          = "Delete"
                # (1 unchanged attribute hidden)
            }
          + condition {
              + days_since_noncurrent_time = 7
              + matches_prefix             = []
              + matches_storage_class      = []
              + matches_suffix             = []
              + num_newer_versions         = 3
              + with_state                 = (known after apply)
                # (3 unchanged attributes hidden)
            }
        }

      + soft_delete_policy (known after apply)

      + versioning {
          + enabled = true
        }

      + website (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to:
/tmp/actions-runner-ghr-common-secfoundation-zxtzw-2/_work/_temp/tf-artifacts/02-folders/02-folders-02-storages/tf-02-folders-02-storages.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "/tmp/actions-runner-ghr-common-secfoundation-zxtzw-2/_work/_temp/tf-artifacts/02-folders/02-folders-02-storages/tf-02-folders-02-storages.plan"
```
</details>

---
[end_section_bootstrap]